# Pandas: Selecting Data with `loc` and `iloc`

In this notebook, we learn how to select data using:

- `.loc` ‚Üí label-based selection  
- `.iloc` ‚Üí position-based selection  

We will cover:
‚úî Selecting rows  
‚úî Selecting columns  
‚úî Selecting rows & columns together  
‚úî Selecting ranges  
‚úî Selecting specific cells  
‚úî Mixing row and column selection

üü¶ 1. Import and Sample DataFrame

In [1]:
import pandas as pd

# Creating a sample dataset
data = {
    "student_id": [101, 102, 103, 104, 105],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "math": [85, 70, 90, 60, 95],
    "physics": [88, 65, 92, 58, 99],
    "attendance": [90, 80, 95, 70, 98]
}

df = pd.DataFrame(data)
df.set_index("student_id", inplace=True)

df

               name  math  physics  attendance
student_id
101           Alice    85       88          90
102             Bob    70       65          80
103         Charlie    90       92          95
104           David    60       58          70
105             Eva    95       99          98

üü¶ 2. Understanding .loc (Label-Based)

2.1 Select a Single Row by Label

In [2]:
df.loc[103]

name          Charlie
math               90
physics            92
attendance         95
Name: 103, dtype: object

2.2 Select Multiple Rows

In [3]:
df.loc[[101, 105]]

             name  math  physics  attendance
student_id
101         Alice    85       88          90
105           Eva    95       99          98

2.3 Select a Range of Rows

In [4]:
df.loc[102:104]

               name  math  physics  attendance
student_id
102             Bob    70       65          80
103         Charlie    90       92          95
104           David    60       58          70

2.4 Select a Column

In [5]:
df.loc[:, "math"]

student_id
101    85
102    70
103    90
104    60
105    95
Name: math, dtype: int64

2.5 Select Multiple Columns

In [6]:
df.loc[:, ["math", "physics"]]

            math  physics
student_id
101           85       88
102           70       65
103           90       92
104           60       58
105           95       99

2.6 Select Rows & Columns Together

In [7]:
df.loc[102:104, ["math", "physics"]]

            math  physics
student_id
102           70       65
103           90       92
104           60       58

2.7 Select a Specific Cell

In [8]:
df.loc[103, "physics"]

92

üü¶ 3. Using .iloc (Position-Based)

3.1 Select Row by Position

In [10]:
df.iloc[2]

name          Charlie
math               90
physics            92
attendance         95
Name: 103, dtype: object

3.2 Select Multiple Rows

In [11]:
df.iloc[[0, 4]]

             name  math  physics  attendance
student_id
101         Alice    85       88          90
105           Eva    95       99          98

3.3 Select Row Range

In [12]:
df.iloc[1:4]

               name  math  physics  attendance
student_id
102             Bob    70       65          80
103         Charlie    90       92          95
104           David    60       58          70

3.4 Select a Column by Position

In [13]:
df.iloc[:, 2]

student_id
101    88
102    65
103    92
104    58
105    99
Name: physics, dtype: int64

3.5 Select Multiple Columns

In [14]:
df.iloc[:, [2, 3]]

            physics  attendance
student_id
101              88          90
102              65          80
103              92          95
104              58          70
105              99          98

3.6 Select Rows & Columns Together

In [15]:
df.iloc[1:4, 2:4]

            physics  attendance
student_id
102              65          80
103              92          95
104              58          70

3.7 Select a Specific Cell

In [16]:
df.iloc[2, 3]

95

üü¶ 4. Mixing Row & Column Selection

We can mix row and column selection using `.loc` or `.iloc`.

4.1 Row by Label, Columns by List

In [17]:
df.loc[105, ["math", "physics"]]

math       95
physics    99
Name: 105, dtype: object

4.2 Rows by Position, Columns by Specific Indices

In [19]:
df.iloc[[1, 3], [1, 3]]

            math  attendance
student_id
102           70          80
104           60          70

üü¶ 5. Common Selection Patterns

5.1 First 3 Students, Only Their Scores

In [28]:
df.iloc[:3, 1:3]

            math  physics
student_id
101           85       88
102           70       65
103           90       92

5.2 Students with High Attendance (Row + Column Subset)

In [24]:
df.loc[df["attendance"] > 90, ["name", "attendance"]]

               name  attendance
student_id
103         Charlie          95
105             Eva          98

# üü¶ 6. Key Comparison Summary

## üîÑ loc vs iloc Summary

| Feature | loc | iloc |
|--------|-----|------|
| Based on | Labels | Positions |
| End in slicing | Inclusive | Exclusive |
| Works with strings | ‚úÖ | ‚ùå |
| Works with indexes | ‚úÖ | ‚úÖ |

### Tip:
Use `.loc` when working with labels (recommended)  
Use `.iloc` when working with pure numerical positions.